using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Gorelovskiy.ru_3._0_Console.AddictionalFunctionsClass
{
    class Exceptions
    {
        //___________________________________________________________________________
        //______________________отсутствует двухмерный рисунок_______________________
        //___________________________________________________________________________
        public void Exception2DPicture()
        {
            Console.WriteLine("Рисунок не выбран!");
            Console.WriteLine("Нажмите любую кнопку, чтобы закрыть окно");
            Console.ReadKey();
            Environment.Exit(0);
        }

        //___________________________________________________________________________
        //______________Рисунок имее недопустимое значение по ширине_________________
        //___________________________________________________________________________
        public void ExeptionBigWidthOfPicture()
        {
            Console.WriteLine("Рисунок слишком широкий, ширина поверхности фасада меньше ширины фасада!");
            Console.WriteLine("Нажмите любую кнопку, чтобы закрыть окно");
            Console.ReadKey();
            Environment.Exit(0);
        }
        //___________________________________________________________________________
        //___________________В тексте УП есть G2 и G3________________________________
        //___________________________________________________________________________
        public void ExeptionInvalidCommand(int numberString, string TextOfCommand)
        {
            Console.WriteLine("УП рисунка имеет недопустимые команды:");
            Console.WriteLine("Строка номер {0}, команда '{1}'",numberString+1,TextOfCommand);
            Console.WriteLine("Нажмите любую кнопку, чтобы закрыть окно");
            Console.ReadKey();
            Environment.Exit(0);
        }
        //___________________________________________________________________________
        //___________________В тексте УП есть G1 и G2________________________________
        //___________________________________________________________________________
        public void Exception3DPicture()
        {
            Console.WriteLine("Файл с трехмерным рисунком открыт в другой программе!");
            Console.WriteLine("Закройте программу с трехмерным рисунком!");
            Console.WriteLine("Нажмите любую кнопку, чтобы закрыть окно");
            Console.ReadKey();
            Environment.Exit(0);
        }
    }
}
